{
  "description": "<p>The goal of project Amber within OpenJDK is to explore the inclusion of smaller, productivity-oriented Java language features.&nbsp;One part of this that has delivered new functionality in recent versions is <em>pattern matching</em>.</p><p>Pattern matching combines application code logic to test if an expression has a specific type or structure and extract components of its state for processing.</p><p>In JDK 14, JEP 305 introduced pattern matching for instanceof, as a preview feature; in JDK 16, this was made a full feature through JEP 394.&nbsp;This simplifies the use of this operator by eliminating the need for an explicit cast and assignment.&nbsp;In JDK 17, JEP 406 added pattern matching for switch.&nbsp;It is now possible to include patterns in switch case labels.</p><p>In this session, we’ll look at the details of these two new language features and a more general look at pattern matching.&nbsp;We’ll also explore future features in this area, such as record patterns (scheduled for JDK 19) and array patterns, which may be included in a subsequent Java release.</p><p>By the end of the session, you’ll be ready to use these powerful new features.</p>",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-b7873f00-ac14-446d-95d3-3cce4f96ed58.jpg",
      "companyName": "Azul",
      "id": "10904",
      "fullName": "Simon Ritter"
    }
  ],
  "summary": "Project Amber is exploring the inclusion of smaller, productivity-oriented Java language features, including pattern matching. In JDK 14, JEP 305 introduced pattern matching for instanceof, and in JDK 16, this was made a full feature through JEP 394. In JDK 17, JEP 406 added pattern matching for switch. In this session, we'll look at the details of these two new language features and a more general look at pattern matching. ",
  "title": "The Art of Java Language Pattern Matching",
  "track": {
    "title": "Java",
    "id": "2754"
  },
  "format": {
    "duration": "PT50m",
    "id": "951",
    "title": "Conference"
  },
  "id": "10954",
  "language": "EN",
  "room": {
    "id": "4704",
    "title": "Room 10"
  }
}