{
  "title": "Building Smart Devices using Java on the Raspberry Pi - An intro to Pi4J.",
  "summary": "Java on a Raspberry Pi is a cheap, small, and powerful way to get started programming. You can use the same JVM applications you're used to on more powerful machines, and Raspberry Pi has a range of sensors and Components that you can use to create interesting projects.",
  "description": "<p>A Raspberry Pi is a full Linux PC with a small form factor and a low price of between 6 and 95€. And of course, you can run Java on it. The same kind of JVM applications you know, love, and use on heavy machines can also be used on the Raspberry Pi. \"Write once, run everywhere\"? Ah yes, that's the promise of Java! But this small board has some additional possibilities you will not find on that fancy server you are running somewhere in the cloud.</p><p>Do you need a touch-screen device to interact with your home automation or a machine? JavaFX, the new Raspberry Pi Zero 2 W (15€), and a touchscreen are the perfect and affordable combo to provide the perfect solution. Yes, with its low price but high specifications, Raspberry Pi is opening whole new worlds.</p><p>And on top of that, all Raspberry Pis have those 40 magical pins to connect an unlimited choice of electronic components. Measuring temperatures and distances, toggling LEDs and relays, controlling the content on a LED matrix or LCD display, playing the Star Wars tune on a buzzer,... the only limit is your imagination! In this talk, we'll take a look at the current state of Pi4J (<a href=\"https://vdbxl22.cfp.dev/www.pi4j.com\" rel=\"noopener noreferrer\" target=\"_blank\">www.pi4j.com</a>) and dive into the code of a few of these example use-cases. Let's experiment with Java on a CrowPi - a Raspberry Pi-based laptop - to read values from sensors and control other electronic components, and show the values on a JavaFX dashboard.</p>",
  "track": {
    "title": "Mind the Geek",
    "id": "2758"
  },
  "id": "13114",
  "room": {
    "title": "Room 4",
    "id": "4706"
  },
  "language": "EN",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-86202750-dd85-40ed-853f-feb5d5507a2f.jpg",
      "companyName": "Azul",
      "id": "13309",
      "fullName": "Frank Delporte"
    }
  ],
  "format": {
    "title": "Conference",
    "duration": "PT50m",
    "id": "951"
  }
}