{
  "summary": "In this session, we will learn how to build and deploy Java microservices to the cloud using Istio, Kubernetes, JHipster, and Spring Cloud. We will see how Istio moves the responsibility of service discovery, load balancing, circuit breaking, monitoring, etc from the application to the platform, and how to use different features of Istio, like load balancing, canary deployments, A/B testing, and routing. We will also cover",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-894c1781-d8c3-4fc6-bcd8-d53e678f3a7e.jpg",
      "companyName": "Okta",
      "fullName": "Deepu K Sasidharan",
      "id": "14902"
    }
  ],
  "description": "<p>Istio is one of the most popular services mesh solutions available these days. In this deep dive session, let us see how to build and deploy Java microservices to the cloud using Istio, Kubernetes, JHipster, and Spring Cloud.</p><p>Istio moves the responsibility of service discovery, load balancing, circuit breaking, monitoring, etc from the application to the platform(Kubernetes) thus letting the developers focus on the business code. But setting it up could be a daunting task for beginners and pros alike. In this session, we will take a deep dive into how Istio works and will learn how to use different features of istio, like load balancing, canary deployments, A/B testing, and so on.</p><p>What you will learn:</p><ul><li>What is a service mesh, how does Istio work, and what features does it offer</li><li>How to build Java microservices quickly using JHipster</li><li>How to add Istio support to your Java microservices</li><li>Setup Istio on a Kubernetes installation (for example on Google Cloud)</li><li>Setup observability and monitoring for the Kubernetes + Istio cluster</li><li>Deploy microservices to Kubernetes</li><li>How to use different Istio features like load balancing, canary deployments, A/B testing, routing, and traffic splits</li><li>Security options for Java + Spring + Istio</li></ul>",
  "language": "EN",
  "track": {
    "id": "1254",
    "title": "Build & Deploy"
  },
  "room": {
    "title": "Room 9",
    "id": "4709"
  },
  "id": "14952",
  "title": "Build and deploy cloud native Java microservices on Kubernetes with Istio service mesh",
  "format": {
    "title": "Deep Dive",
    "id": "959",
    "duration": "PT180m"
  }
}