{
  "language": "EN",
  "room": {
    "title": "Room 5",
    "id": "4710"
  },
  "title": "Distributed applications - Better off with frameworks, Kubernetes, service meshes or all of them at once?",
  "format": {
    "id": "951",
    "title": "Conference",
    "duration": "PT50m"
  },
  "description": "<p>Software Development based on a distributed (microservice) architecture provides both several advantages and new challenges. In order to take advantage of the distribution it requires implementation of service discovery, routing, load-balancing, resilience mechanisms and more.</p><p>Java frameworks like Micronaut, Quarkus or Spring Boot provide dedicated implementations for API Gateways, Service Registries, Circuit Breakers and many more. These functionalities are declared as code dependencies and need to be set at build time.</p><p>If the architecture is running on top of Kubernetes there are alternative options to address these problems. So-called service mesh implementations do not have to be part of the actual application code, but can happen on a the network level of the container. A fairly new approach is emerging with the eBPF technology, which claims to enable service meshes with minimal overhead.</p><p>With this talk I want to compare the approaches to figure out if one, the other or a combination of them might make sense. The talk is split into a theoretical and a live-demo part.</p>",
  "track": {
    "id": "1251",
    "title": "Architecture"
  },
  "summary": "Distributed software architecture based on microservices can provide several advantages, but also new challenges that need to be addressed in a specific way. One approach to address these challenges is to use service meshes, but another option is to Leverage the power of eBPF technology. The talk will provide a overview of these approaches and how they can be used together to create a successful distributed software architecture.</p>",
  "speakers": [
    {
      "photoUrl": "https://avatars.githubusercontent.com/u/11751587?v=4",
      "id": "16060",
      "fullName": "Matthias Haeussler",
      "companyName": "Novatec"
    }
  ],
  "id": "16108"
}