{
  "summary": "In this talk we will quickly present the history behind Docker Compose, and highlight some of the novelties brought by Docker Compose 2.0. We will show you some advanced use cases that you might use as a developer on your local machine. But did you know that Ops can also take advantage of Docker Compose by deploying an entire application to the Cloud? Yes, in a single command an entire application can be deployed to your Cloud provider without the need of Kubernetes.",
  "speakers": [
    {
      "fullName": "Guillaume Lours",
      "id": "17944",
      "companyName": "Docker",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-df4f0c11-6388-41de-b018-0fa49ff5a146.jpg"
    },
    {
      "id": "13311",
      "companyName": "Microsoft",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-15009991-118a-4670-834a-3c73b9ab4188.png",
      "fullName": "Antonio Goncalves"
    }
  ],
  "title": "Docker Compose: From Localhost to Cloud",
  "room": {
    "title": "Room 9",
    "id": "4709"
  },
  "id": "18000",
  "track": {
    "id": "1254",
    "title": "Build & Deploy"
  },
  "format": {
    "duration": "PT50m",
    "id": "951",
    "title": "Conference"
  },
  "language": "EN",
  "description": "<p><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">You know Docker, right? But do you know Docker Compose? Yes? But do you know what’s new in the 2.0 release? And do you know that you can use Docker Compose in your development&nbsp;environment as well as in production? No? Then, this talk is for you.</span></p><p><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">In this talk we will quickly present the history behind Docker Compose, and highlight some of the novelties brought by Docker Compose 2.0. We will show you some advanced use cases that you might use as a developer on your local machine. But did you know that Ops can also take advantage of Docker Compose by deploying an entire application to the Cloud? Yes, in a single command an entire application can be deployed to your Could provider without the need of Kubernetes. And talking a K8s, we will end our talk by giving you some hints on when to use Docker Compose over K8s.</span></p><p><br></p>"
}