{
  "room": {
    "title": "Room 6",
    "id": "4708"
  },
  "track": {
    "title": "Build & Deploy",
    "id": "1254"
  },
  "language": "EN",
  "speakers": [
    {
      "companyName": "Doctolib",
      "fullName": "Bertrand Paquet",
      "id": "18859",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GjdJEGqbU6uKp72FuMu0DMcNaFanacgPVhMk5g7mA=s96-c"
    }
  ],
  "id": "18774",
  "summary": "Doctolib runs on AWS Aurora, and is one of the largest transaction databases in Europe. We are using the biggest available machines, and we are still planning to upscale even more. In this session, we will expose the actual limits, our immediate needs, and what we plan to do afterwards. Our criteria to find a replacement solution. Scalability, code compatibility, costs, hosting… How we chose to benchmark each solution Which solution was tested? And not tested? The result of",
  "format": {
    "title": "Conference",
    "id": "951",
    "duration": "PT50m"
  },
  "title": "Doctolib needs a bigger database. Ok. But which one?",
  "description": "<p><span style=\"color: rgb(14, 16, 26); background-color: transparent;\">For 8 years, Doctolib has allowed millions of users to book medical appointments, using a single PostgreSQL database.</span></p><p><span style=\"color: rgb(14, 16, 26);\">Today, Doctolib runs on AWS Aurora, the AWS managed version of PostgreSQL and is operating one</span><span style=\"color: rgb(14, 16, 26); background-color: transparent;\"> of the largest transaction databases in Europe. We are using the biggest available machines, and we are still planning </span><span style=\"color: rgb(14, 16, 26);\">to upscale even more</span><span style=\"color: rgb(14, 16, 26); background-color: transparent;\">, to support the growth of our business. Yes, it’s possible to split this huge database or to move some parts to another kind of storage. At Doctolib, we like the simplicity of having a single database to deal with.</span></p><p><span style=\"color: rgb(14, 16, 26); background-color: transparent;\">In this session, we will</span></p><ul><li><span style=\"background-color: transparent;\">Expose the actual limits, our immediate needs, and </span>what we plan to do afterwards</li><li><span style=\"background-color: transparent;\">Our criteria to find a replacement solution. Scalability, code compatibility, costs, hosting…</span></li><li><span style=\"background-color: transparent;\">How we chose to benchmark each solution</span></li><li><span style=\"background-color: transparent;\">Which solution was tested? And not tested?</span></li><li><span style=\"background-color: transparent;\">The result of the evaluation of 3 solutions: Spanner, Yugabyte, and Citus.</span></li></ul><p><span style=\"color: rgb(14, 16, 26); background-color: transparent;\">Instead of an ideal solution, we will try to expose which trade-offs were discovered and chosen.</span></p>"
}