{
  "format": {
    "title": "Conference",
    "duration": "PT50m",
    "id": "951"
  },
  "speakers": [
    {
      "fullName": "Pratik Patel",
      "id": "18890",
      "companyName": "Azul System",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-2bf01eff-437d-4051-b992-86885a88073c.png"
    }
  ],
  "track": {
    "id": "2754",
    "title": "Java"
  },
  "id": "19423",
  "title": "Performance Testing Java Applications",
  "language": "EN",
  "room": {
    "title": "Room 10",
    "id": "4704"
  },
  "summary": "In this session, we will review the basics and give you concrete steps to build a robust performance testbed for your Java application. We will be looking at this from a real-world server-side application point of view, specifically for Java apps. We’ll review common problems and how to avoid them. We’ll cover these topics while building up a performance test and running it live.",
  "description": "<p>Every so often,&nbsp;you’ll read a performance benchmark (of a Java or other application), with bold claims for how well X performs compared to Y. Testing the performance of your Java application is an artform rather than engineering, and is a minefield of misconceptions, misunderstanding, and misinformation. In this session, we will review the basics and give you concrete steps to build a robust performance testbed for your application. We will be looking at this from a real-world server-side application point of view, specifically for Java apps. We’ll review common problems and how to avoid them. We’ll cover these topics while building up a performance test and running it live:</p><ul><li>Define your goals: SLA, latency, throughput, stability</li><li>Test env vs. Production env for testing</li><li>The impact of GC on Java app performance</li><li>Tools for setting up, driving load, and getting perf test results</li><li>Testing application infrastructure like Kafka, Spark and Cassandra</li><li>Operating system settings, JVM settings, memory sizing, and CPU sizing</li><li>Analyzing perf test results and finding bottlenecks that are both apparent and not obvious</li></ul>"
}