{
  "speakers": [
    {
      "fullName": "Alex Snaps",
      "companyName": "Red Hat",
      "id": "20055",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GhQb4KqgoPz8CKWKD4dcFvI4LmalPmTIDo5cFC8=s96-c"
    }
  ],
  "room": {
    "title": "Room 7",
    "id": "4707"
  },
  "title": "Confessions of a Rusty Java developer",
  "id": "19443",
  "track": {
    "id": "2758",
    "title": "Mind the Geek"
  },
  "summary": "Rust is a very powerful language that can be used for asynchronous server-side programming. It is also popular among developers on Stack Overflow, which makes it a good choice for learning.",
  "language": "EN",
  "description": "<p>Rust has been picking up momentum over the last few years. It started with being more prevalent in system programming or when targeting WebAssembly. But now in the meantime it has a vibrant ecosystem for asynchronous server-side programming, whether REST API, gRPC and other… Let’s you safely share code across other languages. Not to mention, the most loved programming language on Stack Overflow!</p><p>But why? What does it bring to the table that you might care about? Java addresses many of your current needs, so why even bother? The language is constantly evolving, such as with records, sealed classes and pattern matching…</p><p>In this session we will go through how Rust is different from Java and what it means. This will be a gentle introduction to a language that can be scary at times, because of its compiler error messages, showcasing some of its incredibly powerful features. We’ll see how these enable the use of development patterns when using common data-structures, such as a Map or a List. We’ll also look into the toolchain and all the new target platforms that become available when writing Rust. </p><p>Rust is here to stay… and so is Java. Yet there is lot to learn from looking into the approaches Rust took, that will benefit you as a Java developer with its features to come. And how you can get your Rust code to run on a microcontroller, where a JVM would not run…</p>",
  "format": {
    "duration": "PT50m",
    "id": "951",
    "title": "Conference"
  }
}