{
  "id": "19448",
  "format": {
    "id": "951",
    "title": "Conference",
    "duration": "PT50m"
  },
  "room": {
    "id": "4706",
    "title": "Room 4"
  },
  "track": {
    "id": "1255",
    "title": "Security"
  },
  "speakers": [
    {
      "fullName": "Appu Goundan",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AFdZucpmiKF3ktwzlJqSNXx6MRzi-UTfnJ5PjUfUx5DMFA=s96-c",
      "companyName": "Google",
      "id": "20062"
    },
    {
      "id": "20063",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-25fa30a8-cc17-4a4e-8093-5f5e86fd832d.jpeg",
      "fullName": "Patrick Flynn",
      "companyName": "Chainguard"
    }
  ],
  "description": "<p><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Would you make a sandwich with lettuce or tomatoes you picked up off the street? For most people, we hope, the answer is \"no\". We like to know that our ingredients are clean, who produced them and if they're safe to eat. Today many of us build software with 3rd party packages but there either isn't enough metadata or we're all too lazy to determine if they're truly safe to use. We risk accidentally shipping broken, vulnerable or dangerous software through compromised credentials, dependency confusion attacks or any of the many other techniques malicious actors have at their disposal.</span></p><p><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Sigstore, an OpenSSF project to make cryptographic signing of artifacts easy to do and to verify, is a core part of solving the dependency trust problem. In this talk, by two of the sigstore-java maintainers, we will be introducing you to the Sigstore project and it's use with Maven Central. We’ll show how you, as a producer or consumer of Maven Central artifacts, can use Sigstore to sign and verify your artifacts and protect yourself and your users from malicious software supply chain attacks.</span></p>",
  "summary": "In this talk, we'll introduce you to Sigstore, an OpenSSF project that makes it easy to sign and verify artifacts. You can use Sigstore to protect yourself and your users from malicious software supply chain attacks.",
  "title": "Protecting the world’s greatest open source ecosystem with Sigstore",
  "language": "EN"
}