{
  "language": "EN",
  "room": {
    "id": "4706",
    "title": "Room 4"
  },
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-334661a0-92aa-4237-a69e-513a926dd1ca.jpg",
      "id": "18862",
      "companyName": "Criteo",
      "fullName": "Pooneh Mokariasl"
    }
  ],
  "summary": "The technology industry benefits from an environment that is diverse in terms of ideas, backgrounds, and experiences. However, the pool of female candidates is not large enough to compensate for this gap, and the challenges that exist discourage women from joining and staying in the industry. The goal of this discussion is to share the lived experiences of women in the technology industry in order to motivate others to contribute and help make the tech environment more diverse.",
  "title": "Women's journey in tech",
  "track": {
    "title": "People & Culture",
    "id": "1253"
  },
  "id": "20433",
  "format": {
    "title": "Tools-in-Action",
    "id": "957",
    "duration": "PT30m"
  },
  "description": "<p>Tech companies have found out they benefit when their employees are made up of diverse backgrounds, ideas, experiences and visions.</p><p>Nowadays, we know fixing the challenge of gender imbalance adds more value to the society in several aspects, we care about it and we knows how important it is.</p><p>Thus, the tech companies attempt to change the environment by attracting more women and to make the future of tech more diverse.</p><p>However, the pool of female candidates is not large enough to compensate for this gap. In addition, we agree that the challenges exist which not only discourage women from joining this field but also from staying in it.</p><p>So the following questions could lead us through this journey.</p><ul><li>How is it to work as a woman in the R&amp;D of tech companies?</li><li>Which aspects could be improved?</li><li>How do we ensure that more women will be attracted to R&amp;D sector?</li><li>How we can change society to tackle the diversity imbalance?</li></ul><p>I believe sharing our lived experience as a woman is valuable as it can improve the situation and make the tech environment more diverse than before. By sharing their thoughts, every woman can have a significant role in enhancing the tech environment.</p><p>Let’s talk about the challenges, and the lived experiences and motivate others to express themselves.</p><p>&nbsp;</p>"
}