{
  "language": "EN",
  "speakers": [
    {
      "id": "20576",
      "fullName": "Vincent van der Zijden",
      "companyName": "bright-r",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-642770eb-bb5e-4a55-bba3-794f1e611577.jpg"
    }
  ],
  "description": "<p>Once upon a time, I had to split up a large mono-repository at one of my customers… again. Like any proper mono-repo, it contained a hellish amount of modules, services and libraries. The repository had <em>so many</em> <em>responsibilities</em>, I suspected it could actually make me coffee when provided with right build arguments. And if that wasn’t bad enough, the client decided they needed the new modules in a different build-tool too.</p><p><br></p><p>At the start, I faced the question that has been tormenting developers since ancient times: do it manually or automate it? Of course I chose the latter (if I liked preforming manual labour I would have chosen an other profession). In this talk I will show you how I have spent 10 days to save 3 days of disgusting manual work. I will demonstrate and share the tools that will allow you too to split-up your own monstrous repositories in a couple of minutes.&nbsp;</p><p><br></p><p>Based on a real-world scenario, I will share my journey of finding “the easiest” solution for quickly breaking up large repositories into separate smaller ones. Using live examples, I will show how you can fork your repo’s git-history on a per-file basis (fast!), how you can write your own Gradle plugin to pull apart you project’s modules + dependencies and rewrite them to Maven and what I have learned from my experiences.d</p>",
  "id": "20711",
  "format": {
    "title": "Tools-in-Action",
    "duration": "PT30m",
    "id": "957"
  },
  "room": {
    "id": "4710",
    "title": "Room 5"
  },
  "title": "How I split a 60 module mono-repo in minutes",
  "summary": "In this talk, I will show you how to quickly and easily split up a large mono-repository into smaller ones using a range of tools. I will also share my journey of finding the \"easiest\" solution for doing so, based on a real-world scenario.",
  "track": {
    "id": "1701",
    "title": "Development Practices"
  }
}