{
  "summary": "This workshop will teach you how to move to a new library or framework in small steps, while also increasing your code quality.",
  "language": "EN",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-d6c99034-c240-460e-b155-923dac6796c9.jpg",
      "id": "2801",
      "fullName": "Nico Krijnen",
      "companyName": "Luminis"
    },
    {
      "fullName": "Jettro Coenradie",
      "id": "12102",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-21227b6c-410a-4ca4-bf3f-abf209696c04.jpg",
      "companyName": "Luminis"
    }
  ],
  "title": "How the right architecture helps you make big changes",
  "track": {
    "title": "Architecture",
    "id": "1251"
  },
  "room": {
    "title": "BOF 2",
    "id": "4702"
  },
  "format": {
    "id": "968",
    "title": "Hands-on Lab",
    "duration": "PT180m"
  },
  "id": "3401",
  "description": "<p>You want to move to a different framework, or maybe you have to upgrade that really outdated library, but where do you start? And how do you do that in small steps? This workshop lets you experience how architectures and techniques like hexagonal, vertical slice and domain driven design can help you move through big transformations, while at the same time you increase your code quality!</p><p><br></p><p>Like many of us, your codebase is likely not a nice small microservice and you cannot afford to spend months working on a rewrite. Instead you need to take small steps. But small steps and keeping everything working may seem like a daunting approach. During the workshop, you will will get you acquainted with several techniques and the right mindset that will allow you to make big changes in small steps.</p><p><br></p><p>You can choose to use Java or Kotlin during the workshop.</p><p><br></p><p>To make sure you have a running start and don't lose any time on basic setup during the workshop, please following the preparation instructions at:</p><p><a href=\"https://github.com/nkrijnen/workshop-devoxx-2022\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgba(0, 0, 0, 0.6);\">https://github.com/nkrijnen/workshop-devoxx-2022</a></p><p><br></p><p><span style=\"color: rgb(49, 49, 49);\">TLDR: Install IntelliJ + clone repo + check that tests run.</span></p><p><br></p><p><span style=\"color: rgb(49, 49, 49);\">IMPORTANT NOTE: Based on schedule popularity ❤️ , we'll repeat this HoL on Wednesday afternoon at 14h00 !!</span></p>"
}