{
  "room": {
    "id": "4708",
    "title": "Room 6"
  },
  "format": {
    "id": "959",
    "duration": "PT180m",
    "title": "Deep Dive"
  },
  "language": "EN",
  "summary": "In this article, we will demystify Spring Security and provide a useful method for understanding how it works, and where the extension points are. Through numerous live coding examples, you will get familiar with the general architecture, foundational patterns and common abstraction. You will understand how they are used in the library code, and how you can draw inspiration from them.",
  "id": "3402",
  "title": "Spring Security, demystified",
  "speakers": [
    {
      "companyName": "VMware - Tanzu Spring",
      "fullName": "Daniel Garnier-Moiroux",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-c78c8919-58fd-4fef-ac07-ab3c5725239b.jpg",
      "id": "2565"
    }
  ],
  "track": {
    "title": "Security",
    "id": "1255"
  },
  "description": "<p><em>How I stopped worrying and learned to love security</em></p><p>Ensuring that applications are secure is now high on most \"Deploy to Prod\" checklists. Spring Security is the de-facto standard in the Spring ecosystem, bringing robust security and sensible defaults to web apps. It is flexible enough to fit any use-case, thanks to a myriad of configuration options and innumerable extension points.</p><p>Newcomers to Spring Security can feel lost when they step out of the \"Getting Started\" guides and need to fine-tune Spring-Security to their specific use-case. Developers can find themselves frantically copy-pasting from Stack Overflow until it kinda-sorta works.</p><p>This deep-dive aims to demystify Spring Security and provide a useful method for understanding how it works, and where the extension points are. Through numerous live coding examples, you will get familiar with the general architecture, foundational patterns and common abstraction. You will understand how they are used in the library code, and how you can draw inspiration from them.</p>"
}