{
  "id": "3955",
  "title": "Modern frontends with Thymeleaf and htmx",
  "description": "<p>Frontend development is getting more and more complex when using JavaScript frameworks like Angular or React. On top of that, the landscape is also rapidly changing. Developers claim that this is needed to build the highly interactive web experiences we all come to know and like. However, that is not true. This talk will show how you can use the productive combination of Java 17, Spring Boot, Thymeleaf, and the htmx JavaScript library to build such experiences without writing JavaScript. Adding a few attributes to your HTML will allow you to implement patterns like Click To Edit, Endless Scrolling, Lazy Loading, etc…</p><p>You might think that you need to start your new project with a JavaScript framework because you “might need that interactivity” later. This talk will show that you can use htmx to enhance your web application easily where it makes sense. For the rest of your application, use the simplicity and productivity of server-side rendering.</p><p>htmx is already making great strides in the PHP/Laravel and Python/Django world, it is time for the Java/Spring Boot world to embrace this as well.</p>",
  "track": {
    "title": "UI & UX",
    "id": "2760"
  },
  "room": {
    "title": "Room 4",
    "id": "4706"
  },
  "format": {
    "id": "951",
    "title": "Conference",
    "duration": "PT50m"
  },
  "summary": "Frontend development is getting more and more complex when using JavaScript frameworks like Angular or React. On top of that, the landscape is also rapidly changing. Developers claim that this is needed to build the highly interactive web experiences we all come to know and like. However, that is not true. This talk will show how you can use the productive combination of Java 17, Spring Boot, Thymeleaf, and the htmx JavaScript library to build such experiences without writing JavaScript. ",
  "language": "EN",
  "speakers": [
    {
      "companyName": "Widit",
      "id": "3903",
      "fullName": "Wim Deblauwe",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gj_7c8KzPIlowttklUTZSCMTftjdmHOsMDNNh4FYA=s96-c"
    }
  ]
}