{
  "summary": "We will audit the technical configuration of a Kubernetes cluster, exploit Kubernetes primitives to implement security measures, integrate Falco to detect suspicious actions, and deploy a CI/CD pipeline to detect compromised images during the build.",
  "title": "How to secure a Kubernetes cluster from scratch?",
  "description": "<p>\"<em>You just have deployed your first Kubernetes cluster. You are about to make it accessible to your developers, but your CISO falls on you: he asks you to present all the measures taken to secure the cluster</em>.\" We will start by <strong>auditing the technical configuration </strong>of a Kubernetes cluster in order to <strong>identify vulnerabilities</strong> and <strong>apply patches to technical components</strong>. We will continue with the <strong>exploitation of Kubernetes primitives </strong>to implement security mechanisms (<em>RBAC, AdmissionController, NetworkPolicy, SecurityContext, ...</em>). We will then enrich the cluster with <strong>Open Policy Agent</strong>, a <strong>rules engine</strong> allowing us to apply finer control than Kubernetes primitives. We will also integrate <strong>Falco</strong>, <strong>a behavior analyzer</strong> to detect suspicious actions performed within containers and at the Kubernetes API Server level. We will end with the implementation of a CI/CD pipeline integrating a <strong>vulnerability analysis</strong> carried out with Clair in order to detect compromised images during the build.</p>",
  "id": "4505",
  "room": {
    "id": "4709",
    "title": "Room 9"
  },
  "format": {
    "title": "Deep Dive",
    "duration": "PT180m",
    "id": "959"
  },
  "language": "EN",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-f64a2148-4e73-4b9e-aa61-c6bebd05ae12.jpeg",
      "fullName": "Marion Nicolé",
      "companyName": "Capgemini",
      "id": "17904"
    },
    {
      "id": "4604",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-54d672fa-7e23-43bd-b965-a0423a580c2c.jpg",
      "companyName": "NFQ Asia",
      "fullName": "Ludovic TOISON"
    },
    {
      "id": "17917",
      "companyName": "_",
      "fullName": "Vincent Bodiou",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-95543361-393d-436f-820c-b6f73458d61a.png"
    }
  ],
  "track": {
    "title": "Build & Deploy",
    "id": "1254"
  }
}