{
  "id": "6906",
  "summary": "In cloud-native technology stacks, distributed and polyglot architectures are the norm. Distributed architectures introduce a variety of operational challenges including how to solve availability and performance issues quickly. These challenges have led to the rise of observability. Telemetry data is needed to power observability products. Traditionally, telemetry data has been provided by either open-source projects or commercial vendors. ",
  "description": "<p>In cloud-native technology stacks, distributed and polyglot architectures are the norm. Distributed architectures introduce a variety of operational challenges including how to solve availability and performance issues quickly. </p><p><br></p><p>These challenges have led to the rise of observability. Telemetry data is needed to power observability products. Traditionally, telemetry data has been provided by either open-source projects or commercial vendors. With a lack of standardization, the net result is the lack of data portability and the burden on the user to maintain the instrumentation.</p><p><br></p><p>This session introduces the OpenTelemetry project which solves these problems by providing a single, vendor-agnostic solution. We'll take a look at the different parts of the specification and how OpenTelemetry integrates with popular frameworks and libraries. Finally we look at the interaction with Cloud infrastructure as OpenTelemetry is especially focused on cloud-native applications.</p>",
  "language": "EN",
  "room": {
    "title": "Room 5",
    "id": "4710"
  },
  "speakers": [
    {
      "companyName": "Amazon Web Services",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-315c3b2f-6849-4967-a1dd-034fbc596713.jpg",
      "id": "6556",
      "fullName": "Dennis Kieselhorst"
    }
  ],
  "track": {
    "id": "1254",
    "title": "Build & Deploy"
  },
  "title": "OpenTelemetry – An Observability Framework for Cloud-Native Software",
  "format": {
    "duration": "PT30m",
    "title": "Tools-in-Action",
    "id": "957"
  }
}