{
  "description": "<p>Apache Kafka includes more than just brokers and a consumer/producer API. Kafka includes a broad ecosystem of APIs and tools to help you get data in and out of Kafka brokers and process the events on your topics. In this session, I'll show you how to get started with two of them: Kafka Connect and Kafka Streams.&nbsp;</p><p><br></p><p>To do that, I'll use data from Xbox Live.&nbsp;Gaming is a social activity, so Xbox includes a social aspect, capturing data to share with your friends. This includes details about what games you play and when you play, and the achievements you earn in games. </p><p><br></p><p>Kafka Connect is a Java API for creating connectors that get data from external systems into your Kafka in a reliable and scalable way.&nbsp;I'll show you how I built a simple source connector to surface data from Xbox REST APIs as streams of events on Kafka topics, and demo how this gets Xbox events to show up in Kafka.&nbsp;</p><p><br></p><p>Kafka Streams is a Java API for processing data on your Kafka topics.&nbsp;I’ll show how to use the Kafka Streams API to process Xbox events as they’re emitted - such as cleaning up some of the noisy and erroneous events with filters, enriching events with additional context using transformations, and creating gamerscore leaderboards using aggregations.&nbsp;</p><p><br></p><p>You might think setting up this demo was just an excuse for me to spend more time gaming.&nbsp;Maybe a bit.&nbsp;</p><p><br></p><p>But my goal is to illustrate how developers can use the Java APIs provided by the Kafka ecosystem to get started with event driven architectures.</p>",
  "id": "10899",
  "summary": "",
  "format": {
    "duration": "PT50m",
    "title": "Conference",
    "id": "951"
  },
  "title": "Using Xbox to get started with Kafka Connect & Kafka Streams",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-de8ab97c-7a3b-4dd8-a888-c793a2f88411.jpg",
      "id": "10772",
      "fullName": "Dale Lane",
      "companyName": "IBM"
    }
  ],
  "track": {
    "id": "1252",
    "title": "Data & AI"
  },
  "language": "EN",
  "room": {
    "title": "Exec Centre",
    "id": "19156"
  }
}