{
  "language": "EN",
  "speakers": [
    {
      "id": "10772",
      "companyName": "IBM",
      "fullName": "Dale Lane",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-de8ab97c-7a3b-4dd8-a888-c793a2f88411.jpg"
    },
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-b14ee18b-dac8-479b-adf2-f0ecf5238b7a.jpeg",
      "fullName": "Amelia Fox",
      "companyName": "IBM",
      "id": "20152"
    }
  ],
  "track": {
    "title": "Architecture",
    "id": "1251"
  },
  "room": {
    "title": "Room D",
    "id": "19155"
  },
  "summary": "",
  "description": "<p>AsyncAPI is an open standard for working with event-driven architectures. If you've worked with OpenAPI (or Swagger) before, some of it might look a bit familiar to you, but brought into the asynchronous, event-driven world.</p><p><br></p><p>AsyncAPI complements and supplements the choices we have for serializing/deserializing data (e.g. JSON schemas, Protobuf, Apache Avro, etc.), providing a simple way to add additional descriptions that go beyond field names and data types. It lets us describe more than just message payloads - by putting them in the broader context of our&nbsp;message brokers and event driven applications.</p><p><br></p><p>In this session, I will show you how you can get started with AsyncAPI to document and describe your event-driven applications and the benefits that this can bring.</p><p><br></p><p>AsyncAPI is more than just a specification standard and includes a fast-growing ecosystem of tools to make it easier to build Event Driven Architectures. There are tools to discover events in your&nbsp;message&nbsp;brokers, tools to design, test and mock your event-driven projects, tools to generate Java code projects, Spring Boot projects, and many more. So I'll show you a few examples of these open source projects.&nbsp;</p><p><br></p><p>Finally, the AsyncAPI community is actively working on the next major version of the specification - AsyncAPI 3.0. I will describe some of the changes being discussed, what this means for the future of the specification, and how you can get involved in the discussion.</p>",
  "title": "Supporting Event Driven Architectures with AsyncAPI",
  "id": "11303",
  "format": {
    "duration": "PT30m",
    "title": "Tools-in-Action",
    "id": "957"
  }
}