{
  "track": {
    "id": "1251",
    "title": "Architecture"
  },
  "language": "EN",
  "description": "<p class=\"ql-align-justify\">The demand for real-time has skyrocketed alongside growth in microservices, digital platforms, online transactions, IoT, and machine learning applications.</p><p class=\"ql-align-justify\">It can be a challenge to meet the speed and scalability requirements of these workloads while simultaneously ensuring both simplicity for developers and operation teams, as well as seamless integration with the broader data layer and cloud strategy.</p><p><br></p><p class=\"ql-align-justify\">In this session, we will show and demonstrate that Redis is well suited to meet this challenge. We will showcase rapid development and deployment going from code to cloud and highlight several best practices to achieve scalability and preserve simplicity along the way.</p><p><br></p><p class=\"ql-align-justify\">Using an example architecture for a player engagement &amp; gaming community platform we will share with you how to :</p><p class=\"ql-align-justify\"><br></p><ul><li class=\"ql-align-justify\">get started to build high-performance, highly available data-driven apps with Redis</li></ul><p><br></p><ul><li class=\"ql-align-justify\">create an extremely fast real-time matchmaking service to match players based upon characteristics such as skill levels, locations, and language, using powerful real-time search</li></ul><p><br></p><ul><li class=\"ql-align-justify\">implement with ease a fully geo-distributed data-architecture for real-time leaderboard and ranking around the globe that can scale and grow to millions of players</li></ul><p><br></p>",
  "title": "Build and Deploy Real-time Globally distributed Cloud Apps with Redis",
  "id": "20251",
  "summary": "",
  "speakers": [
    {
      "fullName": "Kamran Yousaf",
      "id": "20151",
      "companyName": "Redis",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-d10a7a20-88de-4dea-9d8b-70b715480175.jpg"
    }
  ],
  "room": {
    "title": "Room D",
    "id": "19155"
  },
  "format": {
    "id": "951",
    "title": "Conference",
    "duration": "PT50m"
  }
}