{
  "description": "<p><span style=\"color: rgb(103, 106, 108);\">In the cloud-native world, being a developer might be challenging. The number of technologies and patterns to know can be overwhelming. This session presents an approach based on open-source technologies and focuses on improving the inner development loop and continuous delivery on Kubernetes. The end goal is to deliver value continuously, quickly, and reliably.<span class=\"ql-cursor\">﻿</span></span></p><p><br></p><p><span style=\"color: rgb(103, 106, 108);\">First, I’ll present several techniques for working locally effectively and productively. Should you run Kubernetes in your development environment? I’ll cover a few different options. Using Java, we’ll build a cloud-native application following the principles of test-driven development. The inner development loop will be enhanced with Cloud Native Buildpacks, Tilt, Knative, and Telepresence.</span></p><p><br></p><p><span style=\"color: rgb(103, 106, 108);\">Continuous integration is a crucial practice for continuous delivery. We’ll check in code regularly, triggering an automated process to build, test, and package the application. Do you use pull requests? Relying on ArgoCD and the GitOps principles, I’ll show you how to work with temporary environments created dynamically when a new pull request is opened.</span></p><p><br></p><p><span style=\"color: rgb(103, 106, 108);\">Finally, we'll use Cartographer to glue together all these different tools and design a golden path to production on Kubernetes, providing a clear separation of concerns and letting developers focus on delivering value.</span></p>",
  "title": "Developer Experience with Java on Kubernetes",
  "language": "EN",
  "format": {
    "id": "951",
    "duration": "PT50m",
    "title": "Conference"
  },
  "track": {
    "title": "Build & Deploy",
    "id": "1254"
  },
  "room": {
    "title": "Gallery Hall",
    "id": "19151"
  },
  "speakers": [
    {
      "id": "2489",
      "companyName": "Systematic",
      "fullName": "Thomas Vitale",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-a6aa298f-bfe8-4c56-bacf-58124afaf8b8.jpg"
    }
  ],
  "summary": "",
  "id": "2716"
}