{
  "description": "<p>When writing new Java (web) applications, teams often have nagging doubts: \"Will my application scale?\"</p><p><br></p><p><br></p><p><br></p><p><br></p><ul><li>How many users can my application simultaneously handle?</li><li>How fast will my controllers dash out those JSON responses?</li><li>How much memory, CPU, or I/O does my application need?&nbsp;</li><li>Where is most time spent in my application?</li><li>How much money do I need to spend on hosting and what instance types are appropriate for my app?</li></ul><p><br></p><p>Surprisingly, there's very little advice out there on how to sensibly approach these questions in a practical way- apart from that deceiving gut feeling that tells you that everything will be fine, by simply auto-scaling your Kubernetes pods into oblivion.</p><p>In this #almostnoslides session we're going to use a terminal, an IDE and a couple of other tools to get a deep, practical understanding of the following scaling topics:</p><p><br></p><p><br></p><p><br></p><p><br></p><ul><li>Throughput: How to reliably find out to how many users your application will scale to</li><li>Memory &amp; CPU: How much (or how little) memory &amp; CPU your Java app actually needs</li><li>Latency: How your web app would compare to a Counterstrike game server</li><li>Servers &amp; Hosting: What the cheapest [cloud] server is able to host</li><li>And much more</li></ul><p><br></p><p>By the end of this talk, you'll have learned all the tools and, more importantly, solid load-testing processes that will hopefully make you never worry about scale again.</p>",
  "title": "Why you don't need to worry about scaling your Java webapp",
  "speakers": [
    {
      "id": "3641",
      "fullName": "Marco Behler",
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-32b05688-37ea-4f4b-878b-726d23c9d4e7.jpg",
      "companyName": "JetBrains"
    }
  ],
  "summary": "",
  "track": {
    "title": "Programming Languages",
    "id": "1401"
  },
  "room": {
    "title": "Gallery Hall",
    "id": "19151"
  },
  "format": {
    "id": "951",
    "duration": "PT50m",
    "title": "Conference"
  },
  "language": "EN",
  "id": "3870"
}