{
  "summary": "",
  "description": "<p><span style=\"background-color: transparent; color: rgb(38, 38, 38);\">The world is moving at an unprecedented pace and much of it has been powered by the innovations in software and systems. While event handling, messaging, and processing are not necessarily brand new concepts, the recent emergence in hardware such as virtualizations, multi-core processors, and so on, are in fact pushing the envelope in software design and development, elevating it to higher levels of capabilities never seen before. In the case of streaming which very often leverages on the underlying messaging mechanism(s) to bring distributed messaging to higher forms of purposes, such as IoT/IIoT applications, AI/ML data pipelines, or even eCommerce recommendations, event streaming platform has indeed become the “glue” in enabling data to flow through disparate systems in the pipeline and in a very dynamic fashion.</span></p><p><span style=\"background-color: transparent; color: rgb(38, 38, 38);\">This talk on event streaming is meant for anyone interested in learning</span>\t<span style=\"background-color: transparent; color: rgb(38, 38, 38);\">g about it, and understanding how it fits into the modern software development design and architecture, as well as seeing some of the challenges it faces especially in the Cloud Native environment. We’ll then take a look at an open source platform - Apache Pulsar, which is poised to become the de facto new generation of distributed messaging and streaming platform that will bring joy to developers, and enable systems and applications to be highly responsive with its true real-time capabilities.</span></p>",
  "language": "EN",
  "speakers": [
    {
      "photoUrl": "https://devoxxian-image-thumbnails.s3-eu-west-1.amazonaws.com/profile-22bfc2cc-d220-409f-8ddc-94019a998ebf.png",
      "companyName": "DataStax",
      "id": "2206",
      "fullName": "Mary Grygleski"
    }
  ],
  "room": {
    "id": "2802",
    "title": "Skalkotas"
  },
  "format": {
    "id": "953",
    "duration": "PT40m",
    "title": "Conference"
  },
  "track": {
    "title": "Architecture",
    "id": "1251"
  },
  "title": "Event Streaming in the Cloud Native World with Apache Pulsar",
  "id": "6305"
}